---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexBuffer.Dispose
source: html/3b9f2298-d268-34b0-405f-754557e1ca49.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexBuffer.Dispose Method

Releases all resources used by the VertexBuffer

## Syntax (C#)
```csharp
public void Dispose()
```